# FileData ğŸ—‚

### ğŸ“Œ Read & Write FileData

```r
> no=c(1,2,3,4)
> name=c("Apple","Banana","Peach","Berry")
> price=c(500,200,300,400)
> qty=c(5,2,7,9)
> fruit=data.frame(No=no, Name=name, Price=price, Quantity=qty)
> fruit
  No   Name Price Quantity
1  1  Apple   500        5
2  2 Banana   200        2
3  3  Peach   300        7
4  4  Berry   400        9
> save(fruit, file="test.dat") # working directory ì— fruitë°ì´í„° ì €ì¥
```

<img src="./screenshots/02_basic1.png" width="500">

working directory ì— ```test.dat``` íŒŒì¼ì´ ìƒˆë¡œ ìƒê²¼ìŒì„ í™•ì¸í•  ìˆ˜ ìˆë‹¤.

```r
> rm(fruit) # fruit ë°ì´í„° ì‚­ì œ 
> fruit
Error: object 'fruit' not found
> load("test.dat") # íŒŒì¼ ì½ê¸°
> fruit
  No   Name Price Quantity
1  1  Apple   500        5
2  2 Banana   200        2
3  3  Peach   300        7
4  4  Berry   400        9
```

<br/>

### ğŸ“Œ Read & Write CSV Data

CSV : Comma Seperated Value

```r
> write.csv(fruit, "fruit.csv")
```

<img src="./screenshots/02_basic2.png" width="500">

<img src="./screenshots/02_basic3.png" width="500">

working directory ì— ```fruit.csv``` íŒŒì¼ì´ ìƒˆë¡œ ìƒê²¼ìŒì„ í™•ì¸í•  ìˆ˜ ìˆë‹¤.

```r
> rm(fruit)
> fruit
Error: object 'fruit' not found
> fruit=read.csv("fruit.csv")
> fruit
  X No   Name Price Quantity
1 1  1  Apple   500        5
2 2  2 Banana   200        2
3 3  3  Peach   300        7
4 4  4  Berry   400        9
```

ìœ„ ëª…ë ¹ì˜¬ csv íŒŒì¼ì„ ì €ì¥í•˜ê³  ë¶ˆëŸ¬ì˜¬ ìˆ˜ ìˆë‹¤.

<img src="./screenshots/03_basic.png" width="500">

ìœ„ì™€ ê°™ì´ í—¤ë”ê°€ ì—†ëŠ” ê²½ìš° ë°ì´í„°ë¥¼  ì½ì–´ë³´ì 


```r
> fruit2<-read.csv("fruit_noheader.csv", header = FALSE)
> fruit2
  V1 V2     V3  V4 V5
1  1  1  Apple 500  5
2  2  2 Banana 200  2
3  3  3  Peach 300  7
4  4  4  Berry 400  9
> names(fruit2)<-c("X", "No", "Name", "Price", "Quantity") # í—¤ë”ë¥¼ ì§ì ‘ ë„£ëŠ”ë‹¤.
> fruit2
  X No   Name Price Quantity
1 1  1  Apple   500        5
2 2  2 Banana   200        2
3 3  3  Peach   300        7
4 4  4  Berry   400        9
```

 
